/*! \file main.cpp
*  \brief Главный исполняемый файл программы для работы со словарем
 *  \details Содержит точку входа в программу, настраивает консоль для корректного
 *           отображения символов и запускает пользовательское меню для работы
 *           со словарем.
 */
#include <iostream>
#include "../Include/Menu.h"
#include <windows.h>

/*! \brief Главная функция программы
 *  \return Код завершения программы (0 - успешное завершение)
 *  \details Точка входа в программу. Выполняет следующие действия:
 *           - Настраивает кодировку консоли для корректного отображения символов
 *           - Выводит приветственное сообщение
 *           - Создает объект меню для работы со словарем
 *           - Запускает основной цикл программы
 *
 *  \note Использует функции библиотеки Windows.h для настройки кодировки консоли в UTF-8,
 *        что обеспечивает правильное отображение русских символов.
 */
int main() {
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);

    Menu MyMenu;
    MyMenu.RunMenu();
    return 0;
}